# Import Libraries

In [1]:
import pandas as pd
import numpy as np
import os

# Import Dataframe

In [2]:
#import path of dataframe
path = r"C:\Users\bhimc\Documents\Instacart Basket Analysis (Career Foundry Rekha)"

In [3]:
#import customers.csv
df_customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

In [40]:
df_customers.head()

,user_id,First Name,Last Name,Gender,State,Age,date_joined,number_of_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [41]:
df_customers.shape

(206209, 10)

In [ ]:
df_customers.info()

# Data Wrangling

In [4]:
#Rename the "Surnam" column to "Last Name"
df_customers.rename(columns = {'Surnam' : 'Last Name'}, inplace = True)

In [5]:
#Rename the "STATE" column to "State"
df_customers.rename(columns = {'STATE' : 'State'}, inplace = True)

In [6]:
#Rename the 'fam_status' column to 'marital_status'
df_customers.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)

In [7]:
#Rename the 'n_dependants' column to 'number_of_dependants'
df_customers.rename(columns = {'n_dependants' : 'number_of_dependants'}, inplace = True)

In [8]:
df_customers['user_id'] = df_customers['user_id'].astype('int32')

In [42]:
df_customers.head()

,user_id,First Name,Last Name,Gender,State,Age,date_joined,number_of_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# Data Quality and Consistancy Checks

In [9]:
#Check for duplicates
df_dups = df_customers[df_customers.duplicated()]

In [10]:
df_dups

Empty DataFrame
Columns: [user_id, First Name, Last Name, Gender, State, Age, date_joined, number_of_dependants, marital_status, income]
Index: []

### No dupliactes were found, no action is needed.

In [11]:
#Check for missing values
df_customers.isnull().sum()

user_id                     0
First Name              11259
Last Name                   0
Gender                      0
State                       0
Age                         0
date_joined                 0
number_of_dependants        0
marital_status              0
income                      0
dtype: int64

### There are a lot of missing values for the "First Name" column, however removing them might alter the results and statistics of the dataframe so they will be kept as they are.

In [20]:
df_customers['Age'] = df_customers['Age'].astype('int32')

In [21]:
df_customers['income'] = df_customers['income'].astype('int32')

In [23]:
df_customers['number_of_dependants'] = df_customers['number_of_dependants'].astype('int32')

In [12]:
# Check data type
df_customers.dtypes

In [43]:
df_customers.info

<bound method DataFrame.info of         user_id First Name Last Name  Gender           State  Age date_joined  \
0         26711    Deborah  Esquivel  Female        Missouri   48    1/1/2017
1         33890   Patricia      Hart  Female      New Mexico   36    1/1/2017
2         65803    Kenneth    Farley    Male           Idaho   35    1/1/2017
3        125935   Michelle     Hicks  Female            Iowa   40    1/1/2017
4        130797        Ann   Gilmore  Female        Maryland   26    1/1/2017
...         ...        ...       ...     ...             ...  ...         ...
206204   168073       Lisa      Case  Female  North Carolina   44    4/1/2020
206205    49635     Jeremy   Robbins    Male          Hawaii   62    4/1/2020
206206   135902      Doris  Richmond  Female        Missouri   66    4/1/2020
206207    81095       Rose   Rollins  Female      California   27    4/1/2020
206208    80148    Cynthia     Noble  Female        New York   55    4/1/2020

        number_of_dependants marital_status  income
0                          3        married  165665
1                          0         single   59285
2                          2        married   99568
3                          0         single   42049
4                          1        married   40374
...                      ...            ...     ...
206204                     1        married  148828
206205                     3        married  168639
206206                     2        married   53374
206207                     1        married   99799
206208                     1        married   57095

[206209 rows x 10 columns]>

# Combine customer data with prepared Instacart Data

In [13]:
#Import orders_products_merged_derived.pkl"
df_ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged_derived.pkl'))

In [44]:
df_ords_prods_merge.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,price_range_loc,busiest_day,busiest_days,busiest_period_of_day
0,2539329,1,1.0,2,8,NaN,196,1,0,Soda,77,7,9.0,Mid_range product,Regularly busy,Regularly busy,Average orders
1,2398795,1,2.0,3,7,15.0,196,1,1,Soda,77,7,9.0,Mid_range product,Regularly busy,Slowest days,Average orders
2,473747,1,3.0,3,12,21.0,196,1,1,Soda,77,7,9.0,Mid_range product,Regularly busy,Slowest days,Most orders
3,2254736,1,4.0,4,7,29.0,196,1,1,Soda,77,7,9.0,Mid_range product,Least busy,Slowest days,Average orders
4,431534,1,5.0,4,15,28.0,196,1,1,Soda,77,7,9.0,Mid_range product,Least busy,Slowest days,Most orders

In [14]:
# Drop the 'eval_set' and "_merge" columns from df_ords_prods_merge because they are no longer needed.
df_ords_prods_merge = df_ords_prods_merge.drop(columns = ['eval_set', '_merge'])

In [ ]:
# Check the datatype of ords_prods_merge dataframe
df_ords_prods_merge.dtypes

In [46]:
# Change the data types of "int64" to "int32", becaude of Memory Error

In [15]:
df_ords_prods_merge['user_id'] = df_ords_prods_merge['user_id'].astype('int32')

In [24]:
df_ords_prods_merge['order_id'] = df_ords_prods_merge['order_id'].astype('int32')

In [25]:
df_ords_prods_merge['order_number'] = df_ords_prods_merge['order_number'].astype('int32')

In [26]:
df_ords_prods_merge['orders_day_of_week'] = df_ords_prods_merge['orders_day_of_week'].astype('int32')

In [27]:
df_ords_prods_merge['order_hour_of_day'] = df_ords_prods_merge['order_hour_of_day'].astype('int32')

In [28]:
df_ords_prods_merge['product_id'] = df_ords_prods_merge['product_id'].astype('int32')

In [29]:
df_ords_prods_merge['add_to_cart_order'] = df_ords_prods_merge['add_to_cart_order'].astype('int32')

In [30]:
df_ords_prods_merge['reordered'] = df_ords_prods_merge['reordered'].astype('int32')

In [32]:
df_ords_prods_merge['aisle_id'] = df_ords_prods_merge['aisle_id'].astype('int32')

In [33]:
df_ords_prods_merge['department_id'] = df_ords_prods_merge['department_id'].astype('int32')

In [34]:
df_ords_prods_merge['order_number'] = df_ords_prods_merge['order_number'].astype('float32')

In [35]:
df_ords_prods_merge['prices'] = df_ords_prods_merge['prices'].astype('float32')

In [36]:
#merge df_ords-prods_merge with df_customers
df_merged_all = df_ords_prods_merge.merge(df_customers, on = 'user_id', indicator = True)

In [37]:
# Check the Frequency of new merged dataframe
df_merged_all['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [38]:
# Check the new dataframe
df_merged_all.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,First Name,Last Name,Gender,State,Age,date_joined,number_of_dependants,marital_status,income,_merge
0,2539329,1,1.0,2,8,NaN,196,1,0,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
1,2398795,1,2.0,3,7,15.0,196,1,1,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
2,473747,1,3.0,3,12,21.0,196,1,1,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
3,2254736,1,4.0,4,7,29.0,196,1,1,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
4,431534,1,5.0,4,15,28.0,196,1,1,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both

### Export the new dataframe as a pkl file

In [39]:
# Export this new dataframe as a pkl file
df_merged_all.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_all.pkl'))